Autodesk.Revit.DB.Structure.RebarDeformationType
Bar deformation type
Since:
2014
Since:
2014

Autodesk.Revit.DB.Structure.RebarDeformationType.Plain
The bar is not ribbed.

Autodesk.Revit.DB.Structure.RebarDeformationType.Deformed
The bar is ribbed.